[{"name": "OS X", "videos": [{"conference": "WWDC 2015", "description": "Cocoa is a powerful set of frameworks on which OS X is built. Gain an overview of the advances in AppKit, Foundation, and related frameworks. Find out what technologies you need to focus on and what techniques you should adopt to develop state of the art apps for OS X. Start here for a high level view of what's changed, and get pointers to relevant sessions for more depth.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/2023wpov1sxpnf9/202/hls_vod_mvp.m3u8", "title": "What's New in Cocoa", "order_id": 11, "session_id": "Session 202", "platform": "OS X"}, {"conference": "WWDC 2015", "description": "The new Force Touch trackpad adds a whole new dimension to user interactions. OS X 10.11 introduces system controls that support pressure behaviors. Understand how to integrate with these behaviors and support them in custom controls. See how to use the Taptic Engine to provide subtle physical feedback based on trackpad input. Hear best practices for adopting new swiping gestures.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/217wu453thu1r1/217/hls_vod_mvp.m3u8", "title": "Adopting New Trackpad Features", "order_id": 26, "session_id": "Session 217", "platform": "OS X"}, {"conference": "WWDC 2015", "description": "Full screen windows enable people to focus on the task at hand by removing extra system UI and deferring to more of the content they care about. OS X 10.11 adds new flexibility to how these full screen windows can be configured and controlled. Hear from the experts how to get your Mac app ready to take advantage of this new functionality. Learn key strategies to making your window content be adaptive depending on the space available.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/22160ycymy0qg/221/hls_vod_mvp.m3u8", "title": "Improving the Full Screen Window Experience", "order_id": 30, "session_id": "Session 221", "platform": "OS X"}, {"conference": "WWDC 2015", "description": "NSCollectionView has been displaying grids of views for many years.  OS X 10.11 brings a major update to the capabilities of NSCollectionView.  Much of the design of UICollectionView in iOS is now available for OS X apps.  Understand the details of the enhancements and how you can harness them in your apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/225629tzulwe0/225/hls_vod_mvp.m3u8", "title": "What's New in NSCollectionView", "order_id": 34, "session_id": "Session 225", "platform": "OS X"}, {"conference": "WWDC 2015", "description": "Learn how to use the new AVMutableMovie class to modify media files and simplify your editing workflows. See how to support segment-based editing and discover the power of sample reference movies.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/5062qehwhs/506/hls_vod_mvp.m3u8", "title": "Editing Movies in AV Foundation", "order_id": 68, "session_id": "Session 506", "platform": "OS X"}, {"conference": "WWDC 2015", "description": "Safari in iOS 9 and OS X El Capitan delivers new ways for your app to extend Safari's behavior. Learn how to create Shared Links and Content Blocking extensions for iOS and OS X, and about changes to the Safari Extension development process.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/511kmynuza/511/hls_vod_mvp.m3u8", "title": "Safari Extensibility: Content Blocking and Shared Links", "order_id": 73, "session_id": "Session 511", "platform": "OS X"}]}, {"name": "OS X, iOS", "videos": [{"conference": "WWDC 2015", "description": "The Network Extension framework allows apps to customize and extend the core networking features of iOS and OS X. Learn how to use new VPN features and NetworkExtension API to create network security solutions for education and enterprise.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/717yq4y85w/717/hls_vod_mvp.m3u8", "title": "What's New in Network Extension and VPN", "order_id": 98, "session_id": "Session 717", "platform": "OS X, iOS"}]}, {"name": "iOS", "videos": [{"conference": "WWDC 2015", "description": "iOS 9 expands on adaptivity with Multitasking. Learn about additions to UIKit to support truly universal layout sizes and types. Get introduced to all-new frameworks and APIs for Cocoa Touch such as a new Contacts framework, text-editing gestures, enhancements to dynamics and visual effects, and much more. Come find out which sessions you won't want to miss throughout the week.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/1075hpxmc54818sn59su/107/hls_vod_mvp.m3u8", "title": "What's New in Cocoa Touch", "order_id": 7, "session_id": "Session 107", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "iOS has transformed the lives of many users with a range of physical and learning disabilities. Learn how to create apps that leverage the power and simplicity of Apple's assistive technologies to make them accessible to the broadest audience possible. Hear about the latest advancements in iOS accessibility and how you can take advantage of them today.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/201pps6n6g0nsnz/201/hls_vod_mvp.m3u8", "title": "iOS Accessibility", "order_id": 10, "session_id": "Session 201", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "HealthKit is Apple's framework to centralize the data storage of personal health information. Hear about the latest enhancements to the framework, supporting new types of data, efficiently deleting objects, and integrating HealthKit into your Apple Watch app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/203bxvbtrom9t1t/203/hls_vod_mvp.m3u8", "title": "What's New in HealthKit", "order_id": 12, "session_id": "Session 203", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "iOS 9 on iPad introduces the ability to view and interact with more than one app at a time. Discover how to update your code to take advantage of enhancements to multitasking and how to participate in Slide Over and Split View. Learn specifics about how to architect your app and understand best practices for adapting to a dynamically sized interface.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/2058z3fx76huw93/205/hls_vod_mvp.m3u8", "title": "Getting Started with Multitasking on iPad in iOS 9", "order_id": 14, "session_id": "Session 205", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "HomeKit is Apple's framework that enables apps to easily and securely interact with HomeKit enabled accessories such as lights, locks, thermostats and more. Learn about the improvements to HomeKit, including support for new accessory types, easy ways to setup and remotely manage accessories.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/210oyq5peqlavb/210/hls_vod_mvp.m3u8", "title": "What's New in HomeKit", "order_id": 19, "session_id": "Session 210", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "iOS 9 on iPad introduces the ability to view and interact with more than one app at a time. Learn advanced techniques for efficiently sharing resources and presenting media while other apps are in the foreground. Tap into the potential of Picture in Picture to allow your video content to play above other apps, and explore multitasking best practices for creating great experiences in this environment.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/211dseo3cn0bnw/211/hls_vod_mvp.m3u8", "title": "Multitasking Essentials for Media-Based Apps on iPad in iOS 9", "order_id": 20, "session_id": "Session 211", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "Multitasking in iOS 9 allows two side-by-side apps and the Picture-in-Picture window to simultaneously run onscreen at the same time. Discover essential techniques for designing efficient, responsive apps to give your users a fluid, immersive experience with Slide Over, Split View, and Picture-in-Picture.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/212mm5ra3oau66/212/hls_vod_mvp.m3u8", "title": "Optimizing Your App for Multitasking on iPad in iOS 9", "order_id": 21, "session_id": "Session 212", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "ResearchKit is an open source framework introduced by Apple that allows researchers and developers to create powerful apps for medical research. Learn how to easily create visual consent flows, real-time dynamic active tasks, and surveys using a variety of customizable modules that you can build upon and share with the community.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/213w6grumlfm0q/213/hls_vod_mvp.m3u8", "title": "Building Apps with ResearchKit", "order_id": 22, "session_id": "Session 213", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "iOS 9 brings complete right-to-left support for Arabic, Hebrew, and other languages.  Going beyond basic text, your app's entire interface can now flip to provide a native right-to-left experience. Learn what behavior you get for free from UIKit, and hear details about adding right-to-left support in custom interfaces.  Hear from experts about how to evaluate the readiness of your app for these languages.  Understand best practices to avoid common pitfalls and to create a seamless bi-directional app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/222ngkqh58b52/222/hls_vod_mvp.m3u8", "title": "New UIKit Support for International User Interfaces", "order_id": 31, "session_id": "Session 222", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "Dynamic interfaces create fluid and rich interactions. Hear about new dynamic behaviors that have been added in UIKit and how to take advantage of them in your applications. Gain a practical understanding of how to integrate dynamics with AutoLayout. Learn about enhancements to UI Kit Visual Effects.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/229fksrj39nd/229/hls_vod_mvp.m3u8", "title": "What's New in UIKit Dynamics and Visual Effects", "order_id": 38, "session_id": "Session 229", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "Small improvements can make a big impact on your iOS app's performance and launch time. Learn best practices to optimize your UIKit-based applications. See how to future-proof your app for what may be next, and walk through numerous real world examples for more responsive and dynamic collection and table views.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/2313dt427pmq/231/hls_vod_mvp.m3u8", "title": "Cocoa Touch Best Practices", "order_id": 40, "session_id": "Session 231", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "Learn about the touch input and drawing pipelines. Gain specific insights in how best to design your app to minimize latency in receiving touches and maximizing the performance of drawing content on the screen. Explore new API in UIKit and learn best practices for faster and smoother input.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/233l9q8hj9mw/233/hls_vod_mvp.m3u8", "title": "Advanced Touch Input on iOS", "order_id": 42, "session_id": "Session 233", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "UIDocument is a robust way to model user-generated content in your app. See how to easily integrate your app's documents with iCloud, file extensions, and document browsers. Learn how to build a document-based app from the ground up.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/234reaz1byqc/234/hls_vod_mvp.m3u8", "title": "Building Document Based Apps", "order_id": 43, "session_id": "Session 234", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "App Analytics is the powerful new tool inside iTunes Connect. Get a walk through of the metrics related to user engagement, marketing campaigns, monetization and more. Gain valuable insights from data that only Apple provides, so you can build better iOS apps and a more informed app business.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/303qzm09e7/303/hls_vod_mvp.m3u8", "title": "Getting the Most out of App Analytics", "order_id": 46, "session_id": "Session 303", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "iAd is Apple's advertising platform, designed to enable developers to monetize and promote their apps in over 100 countries. See how iAd technologies built into iOS make it easy to enable advertising to generate revenue, identify user segments for re-engagement and understand the impact of your marketing campaigns. Learn how to promote your app to new users and create targeted campaigns designed to re-engage those you already have.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/503oad8l55m/503/hls_vod_mvp.m3u8", "title": "Monetize and Promote Your App with iAd", "order_id": 65, "session_id": "Session 503", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "Learn how to increase app engagement by using universal links to lead users directly to your App when they tap links to your website. Discover how Smart App Banners and Shared Web Credentials give your users the most integrated mobile experience possible.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/5091mxk00t/509/hls_vod_mvp.m3u8", "title": "Seamless Linking to Your App", "order_id": 71, "session_id": "Session 509", "platform": "iOS"}, {"conference": "WWDC 2015", "description": "Dive into the tools and technologies used to construct the DemoBots developer sample. Gain a practical understanding of how DemoBots implements its gameplay logic with GameplayKit and visuals using SpriteKit.  See how the sample integrates On Demand Resources and other system services.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/609pzlyunriyjupp/609/hls_vod_mvp.m3u8", "title": "Deeper into GameplayKit with DemoBots", "order_id": 81, "session_id": "Session 609", "platform": "iOS"}]}, {"name": "iOS, OS X", "videos": [{"conference": "WWDC 2015", "description": "See what's new in MapKit. Learn about improvements to existing APIs and new ways of incorporating transit ETAs and Flyover map views in your app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/206v5ce46maax7s/206/hls_vod_mvp.m3u8", "title": "What's New in MapKit", "order_id": 15, "session_id": "Session 206", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "iOS 9 introduces On Demand Resources, enabling the efficient delivery of rich games and full featured applications using dynamically loaded content. Significantly reduce the time between purchasing and running an app from the App Store, while also decreasing the required storage space by downloading and retaining only content that is necessary. Dive into the latest enhancements in app packaging and learn the APIs to allow your app to acquire only its essential resources.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/214dh5q5d0kswh/214/hls_vod_mvp.m3u8", "title": "Introducing On Demand Resources", "order_id": 23, "session_id": "Session 214", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Storyboards are a great way to build the user interface and flow of your application on iOS and OS X. Gain an understanding of how to effectively organize your storyboards, define segues for your interface, and easily unwind transitions. Dive into a detailed discussion of the new APIs, and hear tips on how to create great user interfaces.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/215972d0hjjcfx/215/hls_vod_mvp.m3u8", "title": "What's New in Storyboards", "order_id": 24, "session_id": "Session 215", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Auto Layout is a powerful constraint-based layout engine that can drive complex and dynamic interfaces on both iOS and OS X.   Learn about the new UIStackView, now your first stop for interfaces built with Auto Layout. See how to build self-sizing views using Auto Layout, and gain critical insights into the inner workings of Auto Layout.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/2187le7kpyhdff/218/hls_vod_mvp.m3u8", "title": "Mysteries of Auto Layout, Part 1", "order_id": 27, "session_id": "Session 218", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Continue your pursuit of Auto Layout mastery. Gain high level insight into how Auto Layout works, and strategies for debugging layout issues. Learn how to use new APIs for constraint creation and layout guides to build more complex layouts.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/219u3bqgvsz2g/219/hls_vod_mvp.m3u8", "title": "Mysteries of Auto Layout, Part 2", "order_id": 28, "session_id": "Session 219", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn about the latest enhancements to the Core Data framework. Hear how to efficiently delete objects, ensure uniqueness, and easily migrate your persistent stores to new locations.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/220lgx5lvphj2/220/hls_vod_mvp.m3u8", "title": "What's New in Core Data", "order_id": 29, "session_id": "Session 220", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Whether it's getting contact information, managing a social graph, or adding a new friend, Contacts are a critical piece of many apps. OS X El Capitan and iOS 9 now share a new Contacts API. Understand the design, goals, and benefits of this new framework. Gain critical insights into how to make a smooth transition for your app to this new framework.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/223rmo6dv9hxh/223/hls_vod_mvp.m3u8", "title": "Introducing the Contacts Framework for iOS and OS X", "order_id": 32, "session_id": "Session 223", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Operations are a flexible way to model your app's business logic, but they can do so much more. See how NSOperation forms the heart of the WWDC app, and how using features like dependencies, readiness, and composition allow you to quickly and easily build dynamic and complex apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/2267p2ni281ba/226/hls_vod_mvp.m3u8", "title": "Advanced NSOperations", "order_id": 35, "session_id": "Session 226", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "NSProgress lets you easily and accurately report the progress of work in your app. Understand the concepts behind progress reporting and how to design code that accurately and efficiently reports its progress. Gain specific insights on how to receive progress updates from framework APIs, fold that into your own progress reporting, and show that progress in your app. Hear from the experts about best practices and how to master the NSProgress APIs.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/232f1zopzycv/232/hls_vod_mvp.m3u8", "title": "Best Practices for Progress Reporting", "order_id": 41, "session_id": "Session 232", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn about the latest developments in managing Apple devices in large organizations. Learn the latest techniques to wirelessly configure settings, monitor compliance with policies, install apps and bulk configure devices with ease.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/301tcfp66f/301/hls_vod_mvp.m3u8", "title": "What's New in Managing Apple Devices", "order_id": 44, "session_id": "Session 301", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Automation is the life blood of any organization, providing speed, accuracy, and the ability to efficiently scale in-house processes. See how the automation technologies in OS X can easily and quickly configure shared-use iOS devices, generate, update, and distribute company documents and provide reliable desktop solutions for the back-office. With tools like Automator, AppleScript, and the new JavaScript for Automation (JXA), creating problem-solving solutions has become even easier and even more interesting.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/306vjwcqnm/306/hls_vod_mvp.m3u8", "title": "Supporting the Enterprise with OS X Automation", "order_id": 48, "session_id": "Session 306", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "The app distribution pipeline is becoming more powerful and flexible. Learn to create full featured apps that are delivered to users devices with new App Thinning features such as slicing and ODR. See how to integrate these new features into your continuous integration and testing processes, and discover workflows for creating on-demand, tailored content.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/404l17yio30l549x/404/hls_vod_mvp.m3u8", "title": "App Thinning in Xcode", "order_id": 52, "session_id": "Session 404", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn about the new features in Xcode playgrounds such as inline results, auxiliary sources and resources, multiple pages, and markup for formatted text. Find out how to explore programming problems in a playground, and create engaging experiences for teaching and learning.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/405t69ymgwkmfzc9/405/hls_vod_mvp.m3u8", "title": "Authoring Rich Playgrounds", "order_id": 53, "session_id": "Session 405", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn about exciting new features in WebKit and Safari that will help you make your content feel alive. See compelling new interactions made possible by the Force Touch trackpad and enhanced scrolling support. Expand your design toolkit with high performance filters for stunning image and backdrop effects, and embrace the connected living room with updated AirPlay support.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/501g8vwlgg2/501/hls_vod_mvp.m3u8", "title": "What's New in Web Development in WebKit and Safari", "order_id": 63, "session_id": "Session 501", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "FairPlay streaming provides industrial-grade protection for audio and video content. Learn how to implement and deploy FairPlay streaming to protect content when using HTTP Live Streaming.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/502sufwcpog/502/hls_vod_mvp.m3u8", "title": "Content Protection for HTTP Live Streaming", "order_id": 64, "session_id": "Session 502", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "The new SFSafariViewController class enables you to deliver interactive web content in your app just like Safari, including the key Safari UI elements already familiar to your users. See how to easily bring Safari features like Reader and AutoFill into your app, and provide a great web viewing experience with fewer lines of code.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/5048tyhotl6/504/hls_vod_mvp.m3u8", "title": "Introducing Safari View Controller", "order_id": 66, "session_id": "Session 504", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Safari has a powerful new interface for designing responsive web experiences. Explore this great new feature and other new capabilities and improvements to the Web Inspector-WebKit's built-in development tool. Discover how you can use Safari and Web Inspector to powerfully and efficiently design, debug, and optimize for the web.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/5059xl75l59/505/hls_vod_mvp.m3u8", "title": "Using Safari to Deliver and Debug a Responsive Web Design", "order_id": 67, "session_id": "Session 505", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "See what's new in Core Audio. Learn about enhancements to AVAudioEngine such as Compressed audio format support, more flexible node connections and new Sequencer functionality. Learn how to take advantage of digital audio between your OS X and iOS devices via Lightning. Learn best practices and what's new in AVAudioSession.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/507pq8rldk/507/hls_vod_mvp.m3u8", "title": "What's New in Core Audio", "order_id": 69, "session_id": "Session 507", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn about using Audio Unit Extensions to provide your App with sophisticated audio manipulation and processing capabilities. Explore the architecture and  fundamentals of an App that uses Audio Unit Extensions, and how your app can benefit from their power.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/508691kyzp/508/hls_vod_mvp.m3u8", "title": "Audio Unit Extensions", "order_id": 70, "session_id": "Session 508", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "The newly-unified architecture of Core Image gives iOS and OS X apps access to even more image processing power. Learn about new CIFilters and enhancements to the CIKernel language. See how to use Core Image with AV Foundation and Metal to expand the capabilities of your app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/510jiccqsz/510/hls_vod_mvp.m3u8", "title": "What's New in Core Image", "order_id": 72, "session_id": "Session 510", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Model I/O provides a seamless infrastructure for accessing and managing 3D models. Its high-performance architecture supports reading and writing popular mesh and model formats, textures, and materials. Get introduced to the Model I/O framework and learn key details about its integration with SceneKit, MetalKit, and GLKit.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/602868pb0ow6idb3w/602/hls_vod_mvp.m3u8", "title": "Managing 3D Assets with Model I/O", "order_id": 74, "session_id": "Session 602", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Metal provides extremely efficient access to the GPU through its streamlined API and high-performance architecture. Check out what's new in Metal and dive into support for Metal on OS X. Understand enhancements to the Metal memory model and learn how to prepare assets for delivery in Metal-based apps and games.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/6037pi9rxl6tfss8w/603/hls_vod_mvp.m3u8", "title": "What's New in Metal, Part 1", "order_id": 75, "session_id": "Session 603", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "SpriteKit provides everything you'll need to build 2D games with high-performance graphics and engaging gameplay. Check out new APIs for managing a virtual camera and delivering spatial audio. See the all-new timeline-based Actions editor built right into Xcode, and learn about deep integration with Metal, SceneKit, GameplayKit, and more.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/604gq12qghmv39znb/604/hls_vod_mvp.m3u8", "title": "What's New in SpriteKit", "order_id": 76, "session_id": "Session 604", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "ReplayKit provides an easy-to-use framework that lets players record their gameplay - amazing plays, great victories, or solutions to tough challenges - and share video with other players and viewers online. Get introduced to the ReplayKit framework and see how to enable its capability for sharing game video and audio in your games and other apps. Then get the latest news about Game Center, Apple's social gaming network. Learn about the new model for pre-release testing with Game Center and enhancements for multiplayer games.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/6053hq2fz0ebo0lm/605/hls_vod_mvp.m3u8", "title": "Going Social with ReplayKit and Game Center", "order_id": 77, "session_id": "Session 605", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "SceneKit is a high-level graphics framework that helps you create 3D animated scenes and effects in your apps. See how to take advantage of the new capabilities and performance gains enabled by SceneKit's new Metal-based renderer. Check out the innovative Scene Editor, enabling you to build game levels and other scenes directly within Xcode. Learn about new features for realistic shading, enhancements for physics, and dynamic spatial audio.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/606ui2ppsvalj4nn/606/hls_vod_mvp.m3u8", "title": "Enhancements to SceneKit", "order_id": 78, "session_id": "Session 606", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Your app can be ready to harness the power of Metal starting with just a few lines of code. Get introduced to the new MetalKit framework and learn its simple API for model and texture loading, animation control, and other common tasks. Plug into Metal Performance Shaders and access a powerful library of image-processing operations tuned for Apple hardware.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/607g5z16fpl7pzgi/607/hls_vod_mvp.m3u8", "title": "What's New in Metal, Part 2", "order_id": 79, "session_id": "Session 607", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "GameplayKit provides a collection of essential tools and techniques used to implement gameplay logic. Get introduced to the GameplayKit framework and see how to put its capabilities to work in your own titles. Learn about managing state machines, controlling game entities, and implementing rule systems. Dive into its built-in tools for randomization, pathfinding, and advanced simulation.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/608rpwq1ltvg5nmk/608/hls_vod_mvp.m3u8", "title": "Introducing GameplayKit", "order_id": 80, "session_id": "Session 608", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn best practices to maximize the efficiency of your Metal based apps and attain high frame rates. Gain insight into powerful tools for analyzing and optimizing performance for both the CPU and GPU. Discover how to identify bottlenecks, tune performance hot-spots, and overcome any hurdles that could keep your app from reaching its potential.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/610kn68riy9ms89m/610/hls_vod_mvp.m3u8", "title": "Metal Performance Optimization Techniques", "order_id": 82, "session_id": "Session 610", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "CloudKit is the framework that powers iCloud on iOS, OS X, and now iCloud on the web. Hear how we've been working to make CloudKit more accessible to all your users with the web services API and Javascript library. Learn about reporting available in the updated Dashboard and the new, more flexible public database storage pricing.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/704ci202euy/704/hls_vod_mvp.m3u8", "title": "What's New in CloudKit", "order_id": 86, "session_id": "Session 704", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn why efficient software is the key to long battery life for both OS X and iOS devices. We'll explore where the energy in our batteries goes, how Apple hardware and software efficiently manage energy, and how you can make your code most efficient to ensure long battery life.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/707ysegpumy/707/hls_vod_mvp.m3u8", "title": "Achieving All-day Battery Life", "order_id": 89, "session_id": "Session 707", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Learn how to debug energy issues in your app. See the energy debugging tools on iOS and walk through debugging common energy issues in a sample app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/708xzs0dtwx/708/hls_vod_mvp.m3u8", "title": "Debugging Energy Issues", "order_id": 90, "session_id": "Session 708", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Making your app more discoverable leads to more downloads and generates revenue. iOS 9 adds a variety of ways to surface the rich content in your app making search results more relevant.  Understand how you can enhance search results with App History and CoreSpotlight.  See how small changes on your website can produce better Safari suggestions.  Gain insights into how deep app links can bring people directly where they want to go in your app, making your app's content even more discoverable and searchable than content on the traditional web.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/709jcaer6su/709/hls_vod_mvp.m3u8", "title": "Introducing Search APIs", "order_id": 91, "session_id": "Session 709", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "CloudKit.js is the new library that provides web access to your app data stored in iCloud. Explore the new web service APIs and learn how to extend your iOS or OS X apps to the web using CloudKit.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/710jle9eakx/710/hls_vod_mvp.m3u8", "title": "CloudKit JS and Web Services", "order_id": 92, "session_id": "Session 710", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "The Accelerate framework gives you fast, energy efficient signal and image processing and linear algebra libraries. Learn about a new library, dedicated to high performance compression. simd.h, introduced in iOS 8 and OS X 10.10, is the unified 2d and 3d math library for graphics and games. Find out how you can use simd.h and what's new in iOS 9 and OS X 10.11.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/7125ovmdf36/712/hls_vod_mvp.m3u8", "title": "Low Energy, High Performance: Compression and Accelerate", "order_id": 94, "session_id": "Session 712", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "CloudKit makes it easy to store and retrieve any kind of data from iCloud. Dive into the API with the CloudKit framework team as they explore some of its lesser-known features, explore best practices around subscriptions and queries, and reveal its hidden gems.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/7153rwmu2r/715/hls_vod_mvp.m3u8", "title": "CloudKit Tips and Tricks", "order_id": 97, "session_id": "Session 715", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "IPv6 is growing exponentially and carriers worldwide are moving to pure IPv6 APNs. Learn about new tools to test your apps for compatibility and get expert advice on making sure your apps work in all network environments.  iOS 9 and OS X 10.11 now support the latest TCP standards. Hear from the experts on TCP Fast Open and Explicit Congestion Notification, and find out how it benefits your apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/719ui2k57m/719/hls_vod_mvp.m3u8", "title": "Your App and Next Generation Networks", "order_id": 100, "session_id": "Session 719", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Remote notifications are sent by your server to the Apple Push Notification service, which pushes the notifications to each device. Your app may take different actions, such as displaying a message to the user or downloading new data. Find out about important changes to the provider protocol. Learn about enhancements to the way your app can respond to notifications.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/720xwbi9nl/720/hls_vod_mvp.m3u8", "title": "What's New in Notifications", "order_id": 101, "session_id": "Session 720", "platform": "iOS, OS X"}, {"conference": "WWDC 2015", "description": "Fonts lay at the intersection of design and engineering. Get introduced to typographic principles and how they apply to the San Francisco fonts. Hear what makes this family of fonts unique and how to effectively take advantage of their advanced features. Learn best practices when designing and implementing interfaces with text.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/804eub264zh3x4j9yb/804/hls_vod_mvp.m3u8", "title": "Introducing the New System Fonts", "order_id": 105, "session_id": "Session 804", "platform": "iOS, OS X"}]}, {"name": "iOS, OS X, watchOS", "videos": [{"conference": "WWDC 2015", "description": "WWDC 2015 Keynote", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/1014o78qhj07pbfxt9g7/101/hls_vod_mvp.m3u8", "title": "Keynote", "order_id": 1, "session_id": "Session 101", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "WWDC 2015 Platforms State of the Union", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/1026npwuy2crj2xyuq11/102/hls_vod_mvp.m3u8", "title": "Platforms State of the Union", "order_id": 2, "session_id": "Session 102", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Join us for an unforgettable award ceremony celebrating developers and their outstanding work. The 2015 Apple Design Awards recognize state of the art iOS, OS X, and Apple Watch apps that reflect excellence in design and innovation.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/103ot7lzkdri2fvn1iyh/103/hls_vod_mvp.m3u8", "title": "Apple Design Awards", "order_id": 3, "session_id": "Session 103", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Xcode is the development environment for creating great apps for Apple's platforms. Start the week by watching the Xcode team demonstrate the latest features and improved workflows in Xcode 7. This session also provides a complete overview of the in-depth developer tools topics covered at WWDC 2015.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/104usewvb5m0qbwafx8p/104/hls_vod_mvp.m3u8", "title": "What's New in Xcode", "order_id": 4, "session_id": "Session 104", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Swift continues its rapid advancement with version 2. New optimizations make your app run even faster, and new syntax makes your code more expressive. Learn about powerful new features like error handling, testability, and availability checking. This session will help you write even better apps by moving to Swift 2.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/106z3yjwpfymnauri96m/106/hls_vod_mvp.m3u8", "title": "What's New in Swift", "order_id": 6, "session_id": "Session 106", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "With the majority of Apple's market outside of the US, it's critical to learn about the latest advancements in Internationalization support to make your app truly localized. Gain insight into best practices for using formatters to display information correctly, how to easily handle pluralization in any language, how to avoid the most common localization pitfalls, and much more. Whether you are looking to significantly expand your market or want to take advantage of powerful new features for all languages, you don't want to miss this session.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/227s0ti458qgg/227/hls_vod_mvp.m3u8", "title": "What's New in Internationalization", "order_id": 36, "session_id": "Session 227", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "iTunes Connect is the gateway to sharing your creativity on the App Store. Learn about new opportunities to get your products out on Apple Watch. See how the latest improvements to TestFlight as well as other new upcoming features on the iTunes Connect, will help you make the most of Apple's digital storefront.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/302sxabxp0/302/hls_vod_mvp.m3u8", "title": "What's New in iTunes Connect", "order_id": 45, "session_id": "Session 302", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Get more acquainted with iTunes Connect, your gateway to the App Store. Dive into unique services like TestFlight for beta testing and Transporter to help automate metadata setup for your apps. Discover the power of adding rich media to your app store page, the benefits of broadening your distribution path globally, and the abundance of help resources.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/304ywrr62d/304/hls_vod_mvp.m3u8", "title": "iTunes Connect: Development to Distribution", "order_id": 47, "session_id": "Session 304", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Discover new features that make it easier than ever to craft Objective-C APIs that work beautifully in Swift, as well as new Swift language features that provide even better interoperability. Apple engineers will also discuss enhancements to Apple's SDKs that improve the Swift experience.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/401gee20yy5v2men/401/hls_vod_mvp.m3u8", "title": "Swift and Objective-C Interoperability", "order_id": 49, "session_id": "Session 401", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Enhancements to LLDB simplify life for Swift and Objective-C developers alike. Experienced developers will find new powers within the debugging console, and learn more about the connection between the debugger and Swift REPL. Newcomers will get insight into the range of possibilities hidden behind the LLDB prompt.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/402c0mhxbs8tt52t/402/hls_vod_mvp.m3u8", "title": "What's New in LLDB", "order_id": 50, "session_id": "Session 402", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "See how you can incrementally add Swift into your existing Objective-C codebase and app development workflow. Learn how to leverage Swift's powerful language features to develop robust applications that are faster to write and easier to maintain.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/403l7ohdidhmnkgx/403/hls_vod_mvp.m3u8", "title": "Improving Your Existing Apps with Swift", "order_id": 51, "session_id": "Session 403", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Xcode 7 introduces new UI testing features fully integrated into the IDE. Learn about the new APIs and how UI testing fits in with existing testing features in Xcode. See how to get started by recording your app, and how to efficiently craft and maintain UI tests.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/406o0doszwo8r15m/406/hls_vod_mvp.m3u8", "title": "UI Testing in Xcode", "order_id": 54, "session_id": "Session 406", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Apps that stand out must be attractive, intuitive, and easy to use. Interface Builder experts will give you the skills to turn your idea into a world class app. Learn to use the new stacks feature, create adaptable interfaces, employ asset catalogs, and design custom UI to build an outstanding app for Mac, iPhone, iPad and Apple Watch.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/4072909wwb9o9j3/407/hls_vod_mvp.m3u8", "title": "Implementing UI Designs in Interface Builder", "order_id": 55, "session_id": "Session 407", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "At the heart of Swift's design are two incredibly powerful ideas: protocol-oriented programming and first class value semantics. Each of these concepts benefit predictability, performance, and productivity, but together they can change the way we think about programming. Find out how you can apply these ideas to improve the code you write.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/408509vyudbqvts/408/hls_vod_mvp.m3u8", "title": "Protocol-Oriented Programming in Swift", "order_id": 56, "session_id": "Session 408", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Hear from the experts about how you can write faster Swift code and use Instruments to identify performance bottlenecks. Dive deep into specific techniques that will help you produce the most efficient code possible.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/4097c25o0qhs6g5/409/hls_vod_mvp.m3u8", "title": "Optimizing Swift Performance", "order_id": 57, "session_id": "Session 409", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Xcode 7 includes new code coverage features to help you design a powerful test harness for your app. Learn all about coverage along with integration and improvements with Xcode Server.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/41097fby32x3opk/410/hls_vod_mvp.m3u8", "title": "Continuous Integration and Code Coverage in Xcode", "order_id": 58, "session_id": "Session 410", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Learn how Swift can help you define away some common pitfalls in app development, allowing your apps to benefit from safer runtime behavior while enjoying strong guarantees provided by Swift at compile-time. Hear about how API availability checking in Swift allows you to easily take advantage of new APIs while guaranteeing safe deployment to earlier OS releases. See how enumerations and protocols can help not only maintain compile-time invariants between your app's code and assets but also reduce boilerplate.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/4119flfsnsgmlfy/411/hls_vod_mvp.m3u8", "title": "Swift in Practice", "order_id": 59, "session_id": "Session 411", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Learn about time profiling down to the disassembly level to help you investigate the minute details of your application that affect its performance and responsiveness.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/412rhea5amj6iaf/412/hls_vod_mvp.m3u8", "title": "Profiling in Depth", "order_id": 60, "session_id": "Session 412", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Discover UI debugging and how to use advanced breakpoint actions to quickly explore and fix your app. Learn how the new Address Sanitizer feature finds buffer overflows, use-after-free errors, and other memory corruption bugs at run time.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/413eflf3lrh1tyo/413/hls_vod_mvp.m3u8", "title": "Advanced Debugging and the Address Sanitizer", "order_id": 61, "session_id": "Session 413", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Swift supports rich first-class value types in the form of powerful structs, which provide new ways to architect your apps. Learn about the differences between reference and value types, how value types help you elegantly solve common problems around mutability and thread safety, and discover how Swift's unique capabilities might change the way you think about abstraction.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/414sklk5h2k3ki3/414/hls_vod_mvp.m3u8", "title": "Building Better Apps with Value Types in Swift", "order_id": 62, "session_id": "Session 414", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Learn about new developments in Privacy in iOS, OS X, and watchOS that impact your apps. Hear about best practices for delivering great features and respecting your customers' privacy.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/703kp2dwbwkr/703/hls_vod_mvp.m3u8", "title": "Privacy and Your App", "order_id": 85, "session_id": "Session 703", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Your reputation depends on protecting your users' data. Do this by taking advantage of the Security frameworks built into iOS, OS X and watchOS. Find out about new developments in Security and learn the best practices to develop secure apps and protect your users' data.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/706nu20qkag/706/hls_vod_mvp.m3u8", "title": "Security and Your Apps", "order_id": 88, "session_id": "Session 706", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Learn about App Transport Security, HTTP/2 protocol support, new NSURLSession API, and best practices for networking in apps, extensions, and WatchKit apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/711y6zlz0ll/711/hls_vod_mvp.m3u8", "title": "Networking with NSURLSession", "order_id": 93, "session_id": "Session 711", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Learn what's new in Core Location. Discover how to use Core Location with Apple Watch, and how to make the best use of location services to develop powerful and compelling apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/714tqy593v/714/hls_vod_mvp.m3u8", "title": "What's New in Core Location", "order_id": 96, "session_id": "Session 714", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "watchOS and iOS Multitasking place increased demands on your application's efficiency and responsiveness.  With expert guidance from the GCD team, learn about threads, queues, runloops and best practices for their use in a modern app.  Take a deep dive into QoS, its propagation and advanced techniques for debugging your GCD-enabled app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/718b7aw9tq/718/hls_vod_mvp.m3u8", "title": "Building Responsive and Efficient Apps with GCD", "order_id": 99, "session_id": "Session 718", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Design for tomorrow's products today. See examples of how Apple and partners designed software for Apple Watch and other products before they even existed. Learn techniques for designing and prototyping so you can create great apps for hardware accessories and new products before they are available.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/801auxyvb1pgtkufjk/801/hls_vod_mvp.m3u8", "title": "Designing for Future Hardware", "order_id": 102, "session_id": "Session 801", "platform": "iOS, OS X, watchOS"}, {"conference": "WWDC 2015", "description": "Animation is a powerful tool for creating a delightful and intuitive app experience. We will show you how to get started with animations, how to make them effective for your user interface, and how to save time coding by building animations into interactive prototypes.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/803q4kw6eqia7ssp17/803/hls_vod_mvp.m3u8", "title": "Designing with Animation", "order_id": 104, "session_id": "Session 803", "platform": "iOS, OS X, watchOS"}]}, {"name": "iOS, watchOS", "videos": [{"conference": "WWDC 2015", "description": "App extensions allow powerful ways to expose your application's abilities throughout iOS and other apps. Discover best practices for various extension types and see how to effectively communicate between your extension and its parent application or the network. Learn techniques for using the shared keychain and see how to improve discovery of your share and action extensions.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/224o6pqmtb4ik/224/hls_vod_mvp.m3u8", "title": "App Extension Best Practices", "order_id": 33, "session_id": "Session 224", "platform": "iOS, watchOS"}, {"conference": "WWDC 2015", "description": "Great performance is a prerequisite for delivering a compelling and immersive app experience that keeps users engaged. Learn best practices and strategies for characterizing and improving the performance of your code for iPhone, iPad, and Apple Watch.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/230wt8hs0wt8/230/hls_vod_mvp.m3u8", "title": "Performance on iOS and watchOS", "order_id": 39, "session_id": "Session 230", "platform": "iOS, watchOS"}, {"conference": "WWDC 2015", "description": "Passbook is now Wallet.  Wallet stores your coupons, boarding passes, event tickets, and even the credit and debit cards you use with Apple Pay. In iOS 9, Wallet makes the Apple Pay experience even better and integrates more with Apple Watch.  Learn about the Wallet app, new kinds of passes, and how your app can integrate and interact with Wallet.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/701i2qis0reg/701/hls_vod_mvp.m3u8", "title": "Wallet - The home for Apple Pay and more", "order_id": 83, "session_id": "Session 701", "platform": "iOS, watchOS"}, {"conference": "WWDC 2015", "description": "Apple Pay is the easy, secure, and private way to pay for physical goods and services within apps on iPhone 6, iPad Air 2, and iPad mini 3. Find out how you can increase conversion rates in your checkout experience by integrating with Apple Pay APIs. And learn more about what's new with Apple Pay within apps in iOS 9.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/702lp563ezbr/702/hls_vod_mvp.m3u8", "title": "Apple Pay Within Apps", "order_id": 84, "session_id": "Session 702", "platform": "iOS, watchOS"}, {"conference": "WWDC 2015", "description": "See what's new in Core Motion. Learn how your application can take advantage of the motion sensors on iOS devices. Walk through new features of the pedometer and learn how to use the altimeter to take your app to the next level. Get personal with motion APIs and sensor data on the Apple Watch. Run through a demo that uses motion-context awareness to make an application feel smarter!", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/705qrxhfxo0/705/hls_vod_mvp.m3u8", "title": "What's New in Core Motion", "order_id": 87, "session_id": "Session 705", "platform": "iOS, watchOS"}]}, {"name": "misc", "videos": [{"conference": "WWDC 2015", "description": "When Debbie Sterling heard from Steve Jobs at her Stanford graduation that she should", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/112lwa56zromr4h6uf0/112/hls_vod_mvp.m3u8", "title": "Think Audacious", "order_id": 9, "session_id": "Session 112", "platform": ""}]}, {"name": "watchOS", "videos": [{"conference": "WWDC 2015", "description": "WatchKit for watchOS 2 introduces many new capabilities for creating responsive Watch experiences. Beyond a faster architecture, learn about all new support for the Digital Crown, fluid animations, and media playback and recording. Find out how to make use of accelerometer and heart rate data, as well as providing physical feedback via the Taptic Engine.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/105ncyldc6ofunvsgtan/105/hls_vod_mvp.m3u8", "title": "Introducing WatchKit for watchOS 2", "order_id": 5, "session_id": "Session 105", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Building Watch apps with Xcode 7 is easy and straight-forward. Learn how to build and debug a Watch app for watchOS 2 from the ground up. Walk through adding a Watch app to an existing application, building the user interface, debugging and profiling with Instruments, and discover how to efficiently communicate between iPhone and Apple Watch.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/1086gvs7f4vryixs49s6/108/hls_vod_mvp.m3u8", "title": "Building Watch Apps", "order_id": 8, "session_id": "Session 108", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Building on the strong accessibility support in iOS, Apple Watch offers assistive features like VoiceOver and Zoom.  Gain insights into how these accessibility features work on Apple Watch, and how to make sure your app can be accessible to all users.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/2048w4vdjhe1i1m/204/hls_vod_mvp.m3u8", "title": "Apple Watch Accessibility", "order_id": 13, "session_id": "Session 204", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "watchOS 2 provides a new architecture that runs your WatchKit extension directly on Apple Watch. Take an in-depth look at how this new architecture works. Learn how to migrate existing WatchKit apps to watchOS 2, how to support both versions of watchOS, and hear about updates to Glances and Notifications.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/207id8oiaxrt6lh/207/hls_vod_mvp.m3u8", "title": "WatchKit In-Depth, Part 1", "order_id": 16, "session_id": "Session 207", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Move beyond architecture changes for Watch apps and explore the different ways you can use the Digital Crown to enhance your apps. Find out how to create persistent app experiences to keep your Watch app at the ready for users and learn how to use the playback and recording APIs to add audio and video to your Watch apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/208wc2mdvock1md/208/hls_vod_mvp.m3u8", "title": "WatchKit In-Depth, Part 2", "order_id": 17, "session_id": "Session 208", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Making your app's information available to users on Apple Watch is even easier in watchOS 2. Learn how to create custom complications for Watch faces using the new ClockKit framework and see how to provide data through numerous templates using text and images.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/209c9277tttlt9/209/hls_vod_mvp.m3u8", "title": "Creating Complications with ClockKit", "order_id": 18, "session_id": "Session 209", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Advanced layouts and animations are essential to your app's interface. Gain insights into group layout mechanics and the new element animation APIs introduced in WatchKit for watchOS 2. Understand how to create layouts that work well with animations and learn other techniques to add liveliness to your apps.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/216isrjt4ku9w4/216/hls_vod_mvp.m3u8", "title": "Layout and Animation Techniques for WatchKit", "order_id": 25, "session_id": "Session 216", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Apple Watch apps should load quickly and be responsive to users. Learn tips and tricks for optimizing your existing apps and gain insights specific to communicating between Apple Watch and iPhone, creating responsive layouts, decreasing loading times, and more.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/228eahxjbaops/228/hls_vod_mvp.m3u8", "title": "WatchKit Tips and Tricks", "order_id": 37, "session_id": "Session 228", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Getting information to your Watch app is crucial. Learn how to leverage NSURLSession to get your data from the Internet. Tap into the new WatchConnectivity framework for device to device communication and transferring of data. See real-world examples and learn best practices to understand when to use your WatchKit extension and when to leverage your iPhone app.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/713gc2tqvvb/713/hls_vod_mvp.m3u8", "title": "Introducing Watch Connectivity", "order_id": 95, "session_id": "Session 713", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Apple Watch represents a new chapter in the way people relate to technology. It's the most personal device Apple has ever designed, and it enables new ways to receive information and to interact with apps. Learn about the foundations on which Apple Watch was designed and how they lead to Apple Watch apps that complement the iPhone, support lightweight interaction and deliver timely and relevant information to the wrist. Discover how to create usable and beautiful apps, notifications and glances through effective use of typography, information design, layout, animation, and color.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/802mpzd3nzovlygpbg/802/hls_vod_mvp.m3u8", "title": "Designing for Apple Watch", "order_id": 103, "session_id": "Session 802", "platform": "watchOS"}, {"conference": "WWDC 2015", "description": "Get essential design guidance for creating Apple Watch apps that support quick and efficient interaction, make accessing features and information more convenient, and compliment their companion iOS apps. Learn key tips about information architecture, layout, typography, color and app icon design that will make your app easy to use, beautiful and delightful.", "video_url": "http://devstreaming.apple.com/videos/wwdc/2015/805yjy11epjkgmnn11/805/hls_vod_mvp.m3u8", "title": "Apple Watch Design Tips and Tricks", "order_id": 106, "session_id": "Session 805", "platform": "watchOS"}]}]
